let styles = ['Джаз', 'Блюз', 'Рок-н-Ролл'];
console.log('Початковий вигляд масиву: ' + styles);
console.log();


console.log('Видаляємо і повертаємо останнє значення з масиву: ' + styles.pop());
console.log();


//Додаємо елемент в кінець масиву: 
styles.push('Класика');
console.log('Вигляд масиву після заміни останнього значення: ' + styles);
console.log();


console.log('Видаляємо і повертаємо перше значення масиву: ' + styles.shift());
console.log();


//Додаємо два значення в початок масиву: 
styles.unshift('Реп', 'Реггі');
console.log('Вигляд масиву після добавлення перших двох значень: ' + styles);